Repository: hackpangea/hackpangea.github.io
Catalog: tgchannel/languages/TGchannel-*.po
Languages: fa_ir

source: Auto refresh TGchannel Widget Posts
fa_ir: بروزرسانی پست های کانال

source: Active TGCH_BOT
fa_ir: فعال سازی بات TGCH_BOT

source: If you desire to have the newest posts from your Telegram channel on *TGchannel Widget* , Add "@TGCH_BOT" to your Telegram channel as admin and then click on "Active TGCH_BOT"
fa_ir: اگر میخواهید جدیدترین پست های کانال شما به صورت اتوماتیک در ویجت TGchannel نمایش داده شوند , ربات ما "TGCH_BOT@" را به عنوان مدیر در کانال خود عضو کنید و سپس برروی گزینه *فعال سازی بروزرسان* کلیک کنید.

source: Settings
fa_ir: تنظیمات

source: Setting
fa_ir: تنظیم

source: Telegram Settings
fa_ir: تنظیمات تلگرام

source: channel last post link
fa_ir: لینک آخرین پست کانال

source: Paste the last post link in here
fa_ir: لینک آخرین پست را اینجا کپی کنید

source: Validation
fa_ir: تایید اعتبار لینک

source: Go to the target channel in telegram , then right click on last post , and choose *Copy Post Link* . paste the coppied link here and click on Validation
fa_ir: به کانال مورد نظر رجوع کرده و برروی آخرین پست راست کلیک کنید , سپس برروی گزینه Copy post link کلیک کنید و لینک کپی شده را در فیلد بالا Paste کنید. سپس برروی گزینه تایید اعتبار لینک کلیک کنید.

source: Copy and paste the following shortcode directly into the page, post or widget where you'd like your channel to show up :
fa_ir: برای نمایش کانال خود میتوانید کد کوتاه زیر را در صفجه , نوشته و یا ویجت متن قرار دهید.

source: also you can use **TGchannel Widget** that already exists on Appearance->widgets
fa_ir: همچنین میتوانید از ویجت *TGchannel widget* که هم اکنون در قسمت نمایش->ویجت ها موجود میباشد استفاده کنید.

source: This link is Valid , click on 'Save Changes' button
fa_ir: این لینک معتبر میباشد , برروی دکمه *ذخیره تغییرات* کلیک کنید.

source: Status :
fa_ir: وضعیت :

source: Join Channel
fa_ir: عضویت در کانال

source: Telegram Channel For wordpress
fa_ir: کانال تلگرام برای وردپرس

source: S.J.Hosseini
fa_ir: سید جعفر حسینی
